tap "xcodesorg/made"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# XML 1.0 parser
brew "expat"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU compiler collection
brew "gcc"
# LLVM's OpenMP runtime library
brew "libomp"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# OpenGL Extension Wrangler Library
brew "glew"
# Multi-platform library for OpenGL applications
brew "glfw"
# C++ mathematics library for graphics software
brew "glm"
# Improved top (interactive process viewer)
brew "htop"
# LLM inference in C/C++
brew "llama.cpp"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Next-gen compiler infrastructure
brew "llvm"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Run LLMs with MLX
brew "mlx-lm"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Create, run, and share large language models (LLMs)
brew "ollama"
# High performance message passing library
brew "open-mpi"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Cross-platform library for audio I/O
brew "portaudio"
# Object-relational database system
brew "postgresql@18", link: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# 3D creation suite
cask "blender@lts"
# Web browser focusing on privacy
cask "brave-browser"
# Voice and text chat software
cask "discord"
cask "font-jetbrains-mono-nerd-font"
# Web browser
cask "google-chrome"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Music streaming service
cask "spotify"
# Management tool for Unity
cask "unity-hub"
# Open-source code editor
cask "visual-studio-code"
# Original Xbox Emulator
cask "xemu"
# Video communication and virtual meeting platform
cask "zoom"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
